Repository: sideeffect-io/FunnyBoum
Catalog: FunnyBoom/*.lproj/Localizable.strings
Languages: fr

# difficulty.debutant
source: Beginner
fr: Débutant

# difficulty.veteran
source: Veteran
fr: Vétéran

# power.xray
source: X-Ray
fr: Rayons X

# power.superhero
source: Superhero
fr: Super-héros

# power.placeholder
source: Superhero 88s
fr: Super-héros 88s

# special_notice.xray.title
source: X-RAY CHARGING
fr: X-RAY EN CHARGE

# special_notice.xray.subtitle
source: Scan starts soon. Bombs will be visible for %llds.
fr: Le scan commence bientôt. Les bombes seront visibles pendant %llds.

# special_notice.superhero.title
source: SUIT POWERING UP
fr: ARMURE EN CHARGE

# special_notice.superhero.subtitle
source: Armor starts soon. Bomb tiles are safe for %llds.
fr: L'armure commence bientôt. Les cases bombes sont sans danger pendant %llds.

# special_notice.funny_boom.title
source: CLOWN HUNT LOADING
fr: CHASSE AUX CLOWNS EN PRÉPARATION

# special_notice.funny_boom.subtitle
source: Tap clown faces for +%lld. Hunt lasts %llds.
fr: Mitraillez les clics sur la grille pour révéler les têtes de clown (+%lld chacune). Chasse de %llds.

# hud.time
source: Time
fr: Temps

# hud.bombs
source: Bombs
fr: Bombes

# hud.bombs_left
source: Bombs Left
fr: Bombes restantes

# menu.rules
source: Rules
fr: Règles

# menu.difficulty
source: Difficulty
fr: Difficulté

# menu.board
source: Board
fr: Grille

# menu.section.game
source: Game
fr: Jeu

# menu.rules.subtitle
source: View mechanics and special-square behavior
fr: Voir les mécaniques et les cases spéciales

# menu.scores.subtitle
source: Open top 10 leaderboard
fr: Ouvrir le classement top 10

# menu.mine_density
source: Mine density %lld%%
fr: Densité de mines %lld%%

# menu.board_size
source: Board Size
fr: Taille de grille

# status.idle
source: Tap any square to start. First tap is always safe.
fr: Touchez une case pour commencer. La première touche est toujours sûre.

# status.running
source: Quick press reveals cells. Long press flags bombs.
fr: Appui court pour révéler les cases. Appui long pour marquer les bombes.

# status.won
source: Board completed. Submit your nickname for the top 10.
fr: Grille terminée. Envoyez votre pseudo pour le top 10.

# status.lost
source: Boom. Start a new board when you are ready.
fr: Boum. Lancez une nouvelle grille quand vous êtes prêt.

# action.new_short
source: New
fr: Nouveau

# action.new_game
source: New Game
fr: Nouvelle partie

# action.unflag
source: Unflag
fr: Retirer drapeau

# action.flag
source: Flag
fr: Drapeau

# action.save_top_10
source: Save to Top 10
fr: Enregistrer dans le top 10

# action.new_game_now
source: New Game Now
fr: Nouvelle partie

# action.take_me_there
source: TAKE ME THERE
fr: ON Y VA

# action.take_me_there.hint
source: Skip the countdown and activate this special mode now.
fr: Passer le compte a rebours et activer ce mode special maintenant.

# cell.flagged
source: Flagged tile
fr: Case marquée

# cell.hidden
source: Hidden tile
fr: Case cachée

# cell.bomb
source: Bomb
fr: Bombe

# cell.empty
source: Empty tile
fr: Case vide

# cell.neighbors
source: Tile with %lld neighboring bombs
fr: Case avec %lld bombes voisines

# funny_boom.ready
source: FUNNY BOUM READY
fr: FUNNY BOUM PRÊT

# funny_boom.live
source: FUNNY BOUM LIVE
fr: FUNNY BOUM EN COURS

# funny_boom.wait_instruction
source: Wait, then tap clown heads for +10.
fr: Compte à rebours: mitraillez les clics sur les cases pour révéler les têtes de clown (+10 chacune).

# funny_boom.live_instruction
source: Tap clown heads now for +10.
fr: Mitraillez les clics sur la grille maintenant pour révéler les têtes de clown (+10 chacune).

# funny_boom.starts_in
source: Clown hunt starts in %llds
fr: Départ dans %llds. Mitraillez les clics pour révéler les têtes de clown.

# countdown.starts
source: Starts
fr: Début

# countdown.left
source: Left
fr: Reste

# sheet.menu.title
source: Game Menu
fr: Menu du jeu

# sheet.menu.subtitle
source: Retro controls and run setup
fr: Commandes rétro et réglages de partie

# sheet.rules.title
source: Rules
fr: Règles

# sheet.rules.subtitle
source: Quick briefing before the blast
fr: Briefing rapide avant l'explosion

# sheet.scores.subtitle
source: Fastest and sharpest bomb hunters
fr: Les chasseurs de bombes les plus rapides et précis

# sheet.victory.title
source: Board Cleared
fr: Grille nettoyée

# sheet.victory.subtitle
source: Submit your run to the leaderboard
fr: Envoyez votre partie au classement

# rules.classic.title
source: Classic
fr: Classique

# rules.classic.1
source: Reveal any safe tile. A revealed number tells how many bombs touch that tile in the 8 surrounding positions.
fr: Révélez une case sûre. Un nombre révélé indique combien de bombes touchent cette case dans les 8 positions autour.

# rules.classic.2
source: Tap a bomb and you lose. Reveal every non-bomb tile to win.
fr: Touchez une bombe et vous perdez. Révélez toutes les cases sans bombe pour gagner.

# rules.classic.3
source: When a revealed tile is empty, neighboring empty areas expand automatically.
fr: Quand une case révélée est vide, les zones vides voisines s'ouvrent automatiquement.

# rules.special.title
source: Special Squares
fr: Cases spéciales

# rules.special.1
source: Some empty tiles can trigger +10 points, -10 points, X-Ray vision, Superhero mode, or Funny Boum mode.
fr: Quand vous révélez une case vide pour la première fois, un effet spécial peut se déclencher: +10 points, -10 points, X-Ray, Super-héros ou Funny Boum.

# rules.special.2
source: X-Ray reveals hidden bombs with a pulse for a short time.
fr: X-Ray (8 s) affiche temporairement les bombes cachées sur la grille. Elles restent dangereuses si vous les révélez.

# rules.special.3
source: Superhero mode lets you reveal bombs without losing while it is active.
fr: Super-héros (8 s) vous protège: révéler une bombe ne vous fait pas perdre, et la bombe est neutralisée.

# rules.special.4
source: Funny Boum now starts with a special-mode popup countdown, then launches a short clown hunt. Tap clown faces for +10 points each during the timer.
fr: Funny Boum démarre après un compte à rebours (5 s), puis lance une chasse de 8 s. Touchez un clown pour +10 points; les autres cases ne donnent rien.

# rules.controls.title
source: Controls
fr: Commandes

# rules.controls.1
source: Quick press reveals a tile.
fr: Appui court: révèle une case.

# rules.controls.2
source: Long press flags or unflags a tile.
fr: Appui long: pose ou retire un drapeau.

# scores.points_time
source: Points %lld • Time %llds
fr: Points %lld • Temps %llds

# victory.score_points_time
source: Score %lld • Points %lld • Time %llds
fr: Score %lld • Points %lld • Temps %llds

source: Board
fr: Grille

source: Version # 1.0 (c) B/W,1995.
fr: Version n° 1.0 (c) B/W,1995.

source: 2026 Edition
fr: Édition 2026

source: Retro-modern generation
fr: Génération rétro-moderne

source: Match
fr: Partie

source: quick press: reveal, long press: flag
fr: appui court: révéler, appui long: drapeau

source: New game
fr: Nouvelle partie

source: Reset current board and start a new round
fr: Réinitialiser la grille actuelle et démarrer une nouvelle partie

source: SPECIAL MODE INCOMING
fr: MODE SPÉCIAL IMMINENT

source: Quick press reveals. Long press flags or unflags.
fr: Appui court pour révéler. Appui long pour poser ou retirer un drapeau.

source: Get Ready
fr: Préparez-vous

source: Won
fr: Gagné

source: Close
fr: Fermer

source: No scores yet. Clear a board to enter the ranking.
fr: Aucun score pour l'instant. Terminez une grille pour entrer au classement.

source: NEW
fr: NOUVEAU

source: Nickname
fr: Pseudo

source: BOOM
fr: BOUM

source: The minefield detonated. Launch a fresh run.
fr: Le champ de mines a explosé. Lancez une nouvelle partie.

source: New Game
fr: Nouvelle partie
